In [ ]:
# 리스트 
a = [1, 2, 3, 4, 5]
a[2]    # 인덱싱
a[1:5] # 슬라이싱

[2, 3, 4, 5]

In [ ]:
import pandas as pd

df = pd.read_csv("./temp.csv")
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [ ]:
# 인덱싱(loc) 

df.loc[0]
df.loc[1]

메뉴     카페라떼
가격     5000
칼로리     110
Name: 1, dtype: object

In [6]:
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [7]:
df.loc[1, "가격"]

np.int64(5000)

In [14]:
# 슬라이싱
df.loc[0:7, "가격"]
df.loc[:, "가격"]

0    4500
1    5000
2    5500
3    5000
4    4000
5    5900
6    5300
Name: 가격, dtype: int64

In [15]:
df.loc[1, "가격":"칼로리"]

가격     5000
칼로리     110
Name: 1, dtype: object

In [16]:
df.loc[1:3, "메뉴":"칼로리"]

     메뉴    가격  칼로리
1  카페라떼  5000  110
2  카페모카  5500  250
3  카푸치노  5000  110

In [17]:
# 인덱싱/슬라이싱 (iloc) 

df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [18]:
df.iloc[0]

메뉴     아메리카노
가격      4500
칼로리       10
Name: 0, dtype: object

In [19]:
df.iloc[:, 2]

0     10
1    110
2    250
3    110
4     20
5    210
6      0
Name: 칼로리, dtype: int64

In [20]:
df.iloc[2, 1:3]

가격     5500
칼로리     250
Name: 2, dtype: object

In [22]:
# 데이터 추가/변경

import numpy as np 

df["원산지"] = np.nan
df

      메뉴    가격  칼로리  원산지
0  아메리카노  4500   10  NaN
1   카페라떼  5000  110  NaN
2   카페모카  5500  250  NaN
3   카푸치노  5000  110  NaN
4  에스프레소  4000   20  NaN
5    밀크티  5900  210  NaN
6     녹차  5300    0  NaN

In [23]:
# loc를 통해 값 변경

df.loc[0, "원산지"] = "콜롬비아"
df.loc[2:5, "원산지"] = "과테말라"

df

C:\Users\krcea\AppData\Local\Temp\ipykernel_1860\900086041.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '콜롬비아' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[0, "원산지"] = "콜롬비아"

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20  과테말라
5    밀크티  5900  210  과테말라
6     녹차  5300    0   NaN

In [24]:
# loc를 활용한 값 추가

df.loc["시즌"] = ["크리스마스 라떼", 6000, 500, "한국"]
df

          메뉴    가격  칼로리   원산지
0      아메리카노  4500   10  콜롬비아
1       카페라떼  5000  110   NaN
2       카페모카  5500  250  과테말라
3       카푸치노  5000  110  과테말라
4      에스프레소  4000   20  과테말라
5        밀크티  5900  210  과테말라
6         녹차  5300    0   NaN
시즌  크리스마스 라떼  6000  500    한국

In [25]:
# loc와 딕셔너리를 활용한 값 추가
df.loc[7] = {"메뉴": "구미라떼", "가격": 2000, "칼로리": 20}
df

          메뉴    가격  칼로리   원산지
0      아메리카노  4500   10  콜롬비아
1       카페라떼  5000  110   NaN
2       카페모카  5500  250  과테말라
3       카푸치노  5000  110  과테말라
4      에스프레소  4000   20  과테말라
5        밀크티  5900  210  과테말라
6         녹차  5300    0   NaN
시즌  크리스마스 라떼  6000  500    한국
7       구미라떼  2000   20   NaN

In [ ]:
df.drop("시즌", axis=0, inplace=True)

In [27]:
df

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20  과테말라
5    밀크티  5900  210  과테말라
6     녹차  5300    0   NaN
7   구미라떼  2000   20   NaN

In [28]:
df.to_csv("cafe2.csv", index=False)

In [29]:
# 정렬

df = pd.read_csv("cafe2.csv")
df

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20  과테말라
5    밀크티  5900  210  과테말라
6     녹차  5300    0   NaN
7   구미라떼  2000   20   NaN

In [30]:
df.sort_index()

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20  과테말라
5    밀크티  5900  210  과테말라
6     녹차  5300    0   NaN
7   구미라떼  2000   20   NaN

In [31]:
df.sort_index(ascending=False)

      메뉴    가격  칼로리   원산지
7   구미라떼  2000   20   NaN
6     녹차  5300    0   NaN
5    밀크티  5900  210  과테말라
4  에스프레소  4000   20  과테말라
3   카푸치노  5000  110  과테말라
2   카페모카  5500  250  과테말라
1   카페라떼  5000  110   NaN
0  아메리카노  4500   10  콜롬비아

In [34]:
df = df.sort_values("가격", ascending=True)
df

      메뉴    가격  칼로리   원산지
7   구미라떼  2000   20   NaN
4  에스프레소  4000   20  과테말라
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
3   카푸치노  5000  110  과테말라
6     녹차  5300    0   NaN
2   카페모카  5500  250  과테말라
5    밀크티  5900  210  과테말라

In [36]:
df.sort_values("메뉴", ascending=False, inplace=True)
df

      메뉴    가격  칼로리   원산지
3   카푸치노  5000  110  과테말라
2   카페모카  5500  250  과테말라
1   카페라떼  5000  110   NaN
4  에스프레소  4000   20  과테말라
0  아메리카노  4500   10  콜롬비아
5    밀크티  5900  210  과테말라
6     녹차  5300    0   NaN
7   구미라떼  2000   20   NaN

In [37]:
# 2개 이상의 기준 정렬 

df.sort_values(["가격", "메뉴"], ascending=[True, False], inplace=True)
df

      메뉴    가격  칼로리   원산지
7   구미라떼  2000   20   NaN
4  에스프레소  4000   20  과테말라
0  아메리카노  4500   10  콜롬비아
3   카푸치노  5000  110  과테말라
1   카페라떼  5000  110   NaN
6     녹차  5300    0   NaN
2   카페모카  5500  250  과테말라
5    밀크티  5900  210  과테말라

In [40]:
# 인덱스 초기화
df.reset_index(drop=True)

      메뉴    가격  칼로리   원산지
0   구미라떼  2000   20   NaN
1  에스프레소  4000   20  과테말라
2  아메리카노  4500   10  콜롬비아
3   카푸치노  5000  110  과테말라
4   카페라떼  5000  110   NaN
5     녹차  5300    0   NaN
6   카페모카  5500  250  과테말라
7    밀크티  5900  210  과테말라

In [41]:
## 필터링

df = pd.read_csv("cafe2.csv")

In [42]:
df

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20  과테말라
5    밀크티  5900  210  과테말라
6     녹차  5300    0   NaN
7   구미라떼  2000   20   NaN

In [44]:
cond = df["칼로리"] == 20

In [45]:
df[cond]

      메뉴    가격  칼로리   원산지
4  에스프레소  4000   20  과테말라
7   구미라떼  2000   20   NaN

In [46]:
df

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20  과테말라
5    밀크티  5900  210  과테말라
6     녹차  5300    0   NaN
7   구미라떼  2000   20   NaN

In [47]:
cond = df["원산지"] == "과테말라"
df[cond]

      메뉴    가격  칼로리   원산지
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20  과테말라
5    밀크티  5900  210  과테말라

In [48]:
df

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20  과테말라
5    밀크티  5900  210  과테말라
6     녹차  5300    0   NaN
7   구미라떼  2000   20   NaN

In [ ]:
# 문제. 
# 칼로리가 200 이하이면서 가격이 5000원 이상인 메뉴를 필터링 하세요

In [ ]:
cond = (df["칼로리"] <= 200) & (df["가격"] >= 5000)

cond1 = df["칼로리"] <= 200
cond2 = df["가격"] >= 5000

df[cond1 & cond2]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
3  카푸치노  5000  110  과테말라
6    녹차  5300    0   NaN

In [54]:
# NOT 연산자 

cond = df["칼로리"] < 50
df[~cond]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210  과테말라

In [55]:
# 복수 조건 필터링

cond1 = df["가격"] > 5000
cond2 = df["칼로리"] > 100

df[cond1 | cond2]

     메뉴    가격  칼로리   원산지
1  카페라떼  5000  110   NaN
2  카페모카  5500  250  과테말라
3  카푸치노  5000  110  과테말라
5   밀크티  5900  210  과테말라
6    녹차  5300    0   NaN

In [61]:
# isin 필터링
cond = df["메뉴"].isin(["녹차"])

In [62]:
df[cond]

   메뉴    가격  칼로리  원산지
6  녹차  5300    0  NaN